'use client'
import classes from './page.module.css';
import { Fragment, useState, useEffect, useRef } from 'react';
import { Readex_Pro } from 'next/font/google';
import Navbar from '@/components/navbar/navbar';
import ImagesContainer from "@/components/propertydetailscomponents/imagescontainer/imagescontainer";
import TitleAndDescription from '@/components/propertydetailscomponents/titleanddescription/titledescription';
import Specifications from '@/components/propertydetailscomponents/specifications/specifications';
import Ownerdetails from '@/components/propertydetailscomponents/ownerdetails/ownerdetails';
import PropertyAmenities from '@/components/propertydetailscomponents/amenities/propertyamenities';
import PropertyVideo from '@/components/propertydetailscomponents/propertyvideo/propertyvideo';
import Statistics from '@/components/propertydetailscomponents/statistics/statistics';
import CommentsSection from '@/components/propertydetailscomponents/comments/comments';
import ContactInfo from '@/components/propertydetailscomponents/contactinfo/contactinfo';
import SimilarProperties from '@/components/propertydetailscomponents/similarproperties/similarproperties';
import Footer from '@/components/footer/footer';
import axios from 'axios';
const Readex_Pro_Font = Readex_Pro({ subsets: ['arabic'], weight: '400' });

const images = ['/assets/pics/propertydumpic/pexels-curtis-adams-1694007-3555615.jpg',
    '/assets/pics/propertydumpic/pexels-curtis-adams-1694007-3935316.jpg',
    '/assets/pics/propertydumpic/pexels-hemanthnirujogi-2555635.jpg',
    '/assets/pics/propertydumpic/pexels-igor-starkov-233202-1693946.jpg',
    '/assets/pics/propertydumpic/pexels-pixabay-164522.jpg',
    '/assets/pics/propertydumpic/pexels-pixabay-209315.jpg',
    '/assets/pics/propertydumpic/pexels-pixabay-221540.jpg',
    '/assets/pics/propertydumpic/pexels-pixabay-277667.jpg',
    '/assets/pics/propertydumpic/pexels-sevenstormphotography-981916.jpg'
];

const DUMMY_PROPERTIES = [
    {
        id: '1',
        title: 'شقة سوبر ديلوكس',
        description: `شقة فاخرة للبيع في كورنيش الإذاعة
- المساحة: 200 متر مربع
- عدد الغرف: 5 غرف واسعة
- الطابق: الثاني، بإطلالة رائعة على الكورنيش
- التشطيب: ديكور كامل بتصميم عصري وأنيق
- المرافق: طاقة شمسية للمياه والكهرباء لضمان الاستدامة
- السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "حلب",
        region: "الإذاعة",
        status: 'بيع',
        price: '100000',
        area: '200',
        roomsNumber: '5',
        floor: '2',
        directions: 'غربي-قبلي',
        contact_info: '+963940401235',
        date: '01/01/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '2',
        title: 'شقة بإطلالة رائعة وسعر مغري ',
        description: `شقة بإطلالة رائعة وسعر مغري في الأعظمية – حلب
- المساحة: 150 متر مربع
- عدد الغرف: 5 غرف واسعة ومريحة
- الطابق: الثالث، بإطلالة شرقية-قبلية
- التشطيب: ديكور فاخر وعصري
- المرافق: طاقة شمسية للمياه والكهرباء
- السعر: 60,000 دولار
- الموقع: الأعظمية، مدينة حلب
- حالة العقار: للبيع
- التقييم: 4.3 نجوم
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الأعظمية",
        status: 'بيع',
        price: '60000',
        area: '150',
        roomsNumber: '5',
        floor: '3',
        directions: 'شرقي-قبلي',
        contact_info: '+963940401875',
        date: '08/01/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '3',
        title: 'محل تجاري في شارع اسكندرون',
        description: `🌟
محل تجاري فاخر للبيع في شارع اسكندرون – الجميلية، حلب
🏢 المساحة: 100 متر مربع من الفخامة التجارية
🚪 عدد الغرف: 2 غرف بتصميم عملي وأنيق
📍 الموقع: قلب الجميلية، في منطقة تجارية نشطة تُعد الوجهة المثالية للأعمال الناجحة
🧭 الاتجاه: شرقي، لضوء طبيعي يعزز جاذبية المكان
💰 السعر: 300,000 دولار – استثمار ذكي بمردود مضمون
🔋 المرافق: تجهيزات حديثة تلبي احتياجات المشاريع الطموحة
📞 للتواصل: +963940101235
📅 تاريخ النشر: 01/03/2025
💡 لماذا هذا العقار؟
✔ موقع استراتيجي يجذب العملاء يوميًا
✔ تصميم مرن يناسب مختلف أنواع المشاريع
✔ فرصة ذهبية للاستثمار في منطقة تجارية واعدة
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الجميلية",
        status: 'بيع',
        price: '300000',
        area: '100',
        roomsNumber: '2',
        floor: '0',
        directions: 'شرقي',
        contact_info: '+963940101235',
        date: '01/03/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '4',
        title: ' شقة سوبر ديلوكس في منطقة المالكي',
        description: `🏡 فرصة لا تُفوَّت لاقتناء شقة سوبر ديلوكس في قلب المالكي – دمشق! 🏡
✨ المواصفات الفاخرة:
- المساحة: 300 متر مربع من الفخامة والراحة
- عدد الغرف: 7 غرف بتصميم واسع ومميز
- الطابق: الثالث، بإطلالة ساحرة من ثلاث اتجاهات (شمالي-غربي-قبلي)
- التشطيب: ديكور سوبر ديلوكس بأرقى التصاميم العصرية
- المرافق: طاقة شمسية لتوفير المياه والكهرباء بكفاءة عالية
- السعر: 500,000 دولار – صفقة تستحق الاستثمار
- الموقع: منطقة المالكي الراقية، قلب دمشق النابض بالحياة
- حالة العقار: للبيع – فرصة نادرة للحصول على شقة بهذا المس
`,
        governorate: 'دمشق',
        city: "دمشق",
        region: "المالكي",
        status: 'بيع',
        price: '500000',
        area: '300',
        roomsNumber: '7',
        floor: '3',
        directions: 'شمالي-غربي-قبلي',
        contact_info: '+963948801235',
        date: '06/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '5',
        title: 'أرض زراعية طريق دارة عزة',
        description: `🌿 فرصة ذهبية للاستثمار الزراعي في طريق دارة عزة – حلب! 🌿
✨ المواصفات:
- المساحة: 20,000 متر مربع من الأراضي الخصبة
- عدد الغرف: 1 غرفة داخلية للمرافق الزراعية
- الطابق: الأرضي – مثالي للاستخدام الزراعي المباشر
- الموقع: جنوب مدينة حور، قرب طريق دارة عزة
- السعر: 200,000 دولار – عرض مغري لمستثمري القطاع الزراعي
- حالة العقار: للبيع
- التقييم: 4.3 نجوم
`,
        governorate: 'حلب',
        city: "حور",
        region: "جنوب المدينة",
        status: 'بيع',
        price: '200000',
        area: '20000',
        roomsNumber: '1',
        floor: '0',
        directions: '',
        contact_info: '+963940409935',
        date: '08/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '6',
        title: 'شقة متواضعة في مركز مدينة حمص',
        description: ` شقة متواضعة للإيجار في مركز مدينة حمص – منطقة الإذاعة 🏡
✨ المواصفات:
- المساحة: 100 متر مربع
- عدد الغرف: 4 غرف بتصميم عملي
- الطابق: الرابع، بإطلالة غربية-قبلية تمنح إضاءة رائعة
- السعر: 1,000 دولار سنويا – عرض مناسب في قلب المدينة
- حالة العقار: للإيجار
- الموقع: منطقة الإذاعة، في قلب مدينة حمص
`,
        governorate: 'حمص',
        city: "حمص",
        region: "الحميدية",
        status: 'آجار',
        price: '1000',
        area: '100',
        roomsNumber: '4',
        floor: '4',
        directions: 'غربي-قبلي',
        contact_info: '+963940774435',
        date: '01/03/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '7',
        title: 'مزرعة بمساحة جيدة خان العسل',
        description: `🌿 فرصة ذهبية لامتلاك مزرعة بموقع مميز في خان العسل – حلب! 🌿
✨ المواصفات:
- المساحة: 1,000 متر مربع من الأراضي الخصبة
- عدد الغرف: 6 غرف بتصميم عملي ومريح
- الطابق: أرضي، مناسب للحياة الريفية والاستثمار الزراعي
- الاتجاهات: غربي - قبلي - شرقي - شمالي، لضوء طبيعي طوال اليوم
- الموقع: غرب المدينة، خان العسل – منطقة هادئة ومثالية للزراعة
- المرافق: مجهزة بمسبح واسع (7×5 متر) للاستجمام والراحة
- السعر: 70,000 دولار – فرصة رائعة للاستثمار الريفي
السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "خان العسل",
        region: "غرب المدينة",
        status: 'بيع',
        price: '70000',
        area: '1000',
        roomsNumber: '6',
        floor: '0',
        directions: 'غربي-قبلي-شرقي-شمالي',
        contact_info: '+963940654235',
        date: '01/04/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '8',
        title: 'شقة سوبر ديلوكس',
        description: `شقة فاخرة للبيع في كورنيش الإذاعة
- المساحة: 200 متر مربع
- عدد الغرف: 5 غرف واسعة
- الطابق: الثاني، بإطلالة رائعة على الكورنيش
- التشطيب: ديكور كامل بتصميم عصري وأنيق
- المرافق: طاقة شمسية للمياه والكهرباء لضمان الاستدامة
- السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "حلب",
        region: "حلب الجديدة شمالي",
        status: 'بيع',
        price: '200000',
        area: '250',
        roomsNumber: '6',
        floor: '4',
        directions: 'شمالي-غربي-قبلي',
        contact_info: '+963948888235',
        date: '01/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '9',
        title: 'مستودع لتخزين البضائع بمساحة واسعة',
        description: ` فرصة رائعة لامتلاك مستودع واسع لتخزين البضائع في حي الوادي – حماة! 🏢
✨ المواصفات:
- المساحة: 300 متر مربع لتخزين وتنظيم البضائع بسهولة
- عدد الغرف: 2 غرف داخلية لتوفير أقصى درجات الراحة والعملية
- الطابق: الأرضي، مما يسهل عمليات التحميل والتفريغ
- الاتجاهات: شمالي - شرقي، لإضاءة طبيعية وتهوية جيدة
- الموقع: حي الوادي، حماة – منطقة حيوية ومناسبة للأعمال التجارية
- السعر: 50,000 دولار – عرض مغري للاستثمار
`,
        governorate: 'حماة',
        city: "حماة",
        region: "حي الوادي",
        status: 'بيع',
        price: '50000',
        area: '300',
        roomsNumber: '2',
        floor: '0',
        directions: 'شمالي-شرقي',
        contact_info: '+963940401235',
        date: '01/04/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '10',
        title: ' شقة سوبر ديلوكس في الفرقان',
        description: `شقة فاخرة للبيع في كورنيش الإذاعة
- المساحة: 200 متر مربع
- عدد الغرف: 5 غرف واسعة
- الطابق: الثاني، بإطلالة رائعة على الكورنيش
- التشطيب: ديكور كامل بتصميم عصري وأنيق
- المرافق: طاقة شمسية للمياه والكهرباء لضمان الاستدامة
- السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "حلب",
        region: "الفرقان",
        status: 'بيع',
        price: '150000',
        area: '200',
        roomsNumber: '5',
        floor: '2',
        directions: 'غربي-قبلي',
        contact_info: '+963940401235',
        date: '01/01/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '11',
        title: 'شقة بإطلالة رائعة ومساحة واسعة ',
        description: `شقة بإطلالة رائعة وسعر مغري في الأعظمية – حلب
- المساحة: 150 متر مربع
- عدد الغرف: 5 غرف واسعة ومريحة
- الطابق: الثالث، بإطلالة شرقية-قبلية
- التشطيب: ديكور فاخر وعصري
- المرافق: طاقة شمسية للمياه والكهرباء
- السعر: 60,000 دولار
- الموقع: الأعظمية، مدينة حلب
- حالة العقار: للبيع
- التقييم: 4.3 نجوم
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الزبدية",
        status: 'بيع',
        price: '60000',
        area: '150',
        roomsNumber: '5',
        floor: '3',
        directions: 'شرقي-قبلي',
        contact_info: '+963940401875',
        date: '08/01/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '12',
        title: 'محل تجاري في الفرقان',
        description: `🌟
محل تجاري فاخر للبيع في شارع اسكندرون – الجميلية، حلب
🏢 المساحة: 100 متر مربع من الفخامة التجارية
🚪 عدد الغرف: 2 غرف بتصميم عملي وأنيق
📍 الموقع: قلب الجميلية، في منطقة تجارية نشطة تُعد الوجهة المثالية للأعمال الناجحة
🧭 الاتجاه: شرقي، لضوء طبيعي يعزز جاذبية المكان
💰 السعر: 300,000 دولار – استثمار ذكي بمردود مضمون
🔋 المرافق: تجهيزات حديثة تلبي احتياجات المشاريع الطموحة
📞 للتواصل: +963940101235
📅 تاريخ النشر: 01/03/2025
💡 لماذا هذا العقار؟
✔ موقع استراتيجي يجذب العملاء يوميًا
✔ تصميم مرن يناسب مختلف أنواع المشاريع
✔ فرصة ذهبية للاستثمار في منطقة تجارية واعدة
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الفرقان",
        status: 'بيع',
        price: '300000',
        area: '100',
        roomsNumber: '2',
        floor: '0',
        directions: 'شرقي',
        contact_info: '+963940101235',
        date: '01/03/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '13',
        title: ' شقة سوبر ديلوكس في الشهباء',
        description: `🏡 فرصة لا تُفوَّت لاقتناء شقة سوبر ديلوكس في قلب المالكي – دمشق! 🏡
✨ المواصفات الفاخرة:
- المساحة: 300 متر مربع من الفخامة والراحة
- عدد الغرف: 7 غرف بتصميم واسع ومميز
- الطابق: الثالث، بإطلالة ساحرة من ثلاث اتجاهات (شمالي-غربي-قبلي)
- التشطيب: ديكور سوبر ديلوكس بأرقى التصاميم العصرية
- المرافق: طاقة شمسية لتوفير المياه والكهرباء بكفاءة عالية
- السعر: 500,000 دولار – صفقة تستحق الاستثمار
- الموقع: منطقة المالكي الراقية، قلب دمشق النابض بالحياة
- حالة العقار: للبيع – فرصة نادرة للحصول على شقة بهذا المس
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الشهباء",
        status: 'بيع',
        price: '500000',
        area: '300',
        roomsNumber: '7',
        floor: '3',
        directions: 'شمالي-غربي-قبلي',
        contact_info: '+963948801235',
        date: '06/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '14',
        title: 'أرض زراعية طريق كفر حمرة',
        description: `🌿 فرصة ذهبية للاستثمار الزراعي في طريق دارة عزة – حلب! 🌿
✨ المواصفات:
- المساحة: 20,000 متر مربع من الأراضي الخصبة
- عدد الغرف: 1 غرفة داخلية للمرافق الزراعية
- الطابق: الأرضي – مثالي للاستخدام الزراعي المباشر
- الموقع: جنوب مدينة حور، قرب طريق دارة عزة
- السعر: 200,000 دولار – عرض مغري لمستثمري القطاع الزراعي
- حالة العقار: للبيع
- التقييم: 4.3 نجوم
`,
        governorate: 'حلب',
        city: "كفر حمرة",
        region: "جنوب المدينة",
        status: 'بيع',
        price: '200000',
        area: '20000',
        roomsNumber: '1',
        floor: '0',
        directions: '',
        contact_info: '+963940409935',
        date: '08/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '15',
        title: 'شقة متواضعة في حلب',
        description: ` شقة متواضعة للإيجار في مركز مدينة حمص – منطقة الإذاعة 🏡
✨ المواصفات:
- المساحة: 100 متر مربع
- عدد الغرف: 4 غرف بتصميم عملي
- الطابق: الرابع، بإطلالة غربية-قبلية تمنح إضاءة رائعة
- السعر: 1,000 دولار سنويا – عرض مناسب في قلب المدينة
- حالة العقار: للإيجار
- الموقع: منطقة الإذاعة، في قلب مدينة حمص
`,
        governorate: 'حلب',
        city: "حلب",
        region: "صلاح الدين",
        status: 'آجار',
        price: '1000',
        area: '100',
        roomsNumber: '4',
        floor: '4',
        directions: 'غربي-قبلي',
        contact_info: '+963940774435',
        date: '01/03/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '16',
        title: 'مزرعة بمساحة جيدة الاتارب ',
        description: `🌿 فرصة ذهبية لامتلاك مزرعة بموقع مميز في خان العسل – حلب! 🌿
✨ المواصفات:
- المساحة: 1,000 متر مربع من الأراضي الخصبة
- عدد الغرف: 6 غرف بتصميم عملي ومريح
- الطابق: أرضي، مناسب للحياة الريفية والاستثمار الزراعي
- الاتجاهات: غربي - قبلي - شرقي - شمالي، لضوء طبيعي طوال اليوم
- الموقع: غرب المدينة، خان العسل – منطقة هادئة ومثالية للزراعة
- المرافق: مجهزة بمسبح واسع (7×5 متر) للاستجمام والراحة
- السعر: 70,000 دولار – فرصة رائعة للاستثمار الريفي
السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "الاتارب",
        region: "غرب المدينة",
        status: 'بيع',
        price: '70000',
        area: '1000',
        roomsNumber: '6',
        floor: '0',
        directions: 'غربي-قبلي-شرقي-شمالي',
        contact_info: '+963940654235',
        date: '01/04/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '17',
        title: 'شقة اكساء مميز',
        description: `شقة فاخرة للبيع في كورنيش الإذاعة
- المساحة: 200 متر مربع
- عدد الغرف: 5 غرف واسعة
- الطابق: الثاني، بإطلالة رائعة على الكورنيش
- التشطيب: ديكور كامل بتصميم عصري وأنيق
- المرافق: طاقة شمسية للمياه والكهرباء لضمان الاستدامة
- السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "حلب",
        region: "حلب الجديدة جنوبي",
        status: 'بيع',
        price: '200000',
        area: '250',
        roomsNumber: '6',
        floor: '4',
        directions: 'شمالي-غربي-قبلي',
        contact_info: '+963948888235',
        date: '01/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '18',
        title: 'محل تجاري',
        description: ` فرصة رائعة لامتلاك مستودع واسع لتخزين البضائع في حي الوادي – حماة! 🏢
✨ المواصفات:
- المساحة: 300 متر مربع لتخزين وتنظيم البضائع بسهولة
- عدد الغرف: 2 غرف داخلية لتوفير أقصى درجات الراحة والعملية
- الطابق: الأرضي، مما يسهل عمليات التحميل والتفريغ
- الاتجاهات: شمالي - شرقي، لإضاءة طبيعية وتهوية جيدة
- الموقع: حي الوادي، حماة – منطقة حيوية ومناسبة للأعمال التجارية
- السعر: 50,000 دولار – عرض مغري للاستثمار
`,
        governorate: 'حماة',
        city: "حماة",
        region: "حي الوادي",
        status: 'بيع',
        price: '50000',
        area: '300',
        roomsNumber: '2',
        floor: '0',
        directions: 'شمالي-شرقي',
        contact_info: '+963940401235',
        date: '01/04/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '19',
        title: 'شقة باطلالة رائعة ',
        description: `شقة فاخرة للبيع في كورنيش الإذاعة
- المساحة: 200 متر مربع
- عدد الغرف: 5 غرف واسعة
- الطابق: الثاني، بإطلالة رائعة على الكورنيش
- التشطيب: ديكور كامل بتصميم عصري وأنيق
- المرافق: طاقة شمسية للمياه والكهرباء لضمان الاستدامة
- السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "حلب",
        region: "الإذاعة",
        status: 'بيع',
        price: '100000',
        area: '200',
        roomsNumber: '5',
        floor: '2',
        directions: 'غربي-قبلي',
        contact_info: '+963940401235',
        date: '01/01/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '20',
        title: 'معمل',
        description: `شقة بإطلالة رائعة وسعر مغري في الأعظمية – حلب
- المساحة: 150 متر مربع
- عدد الغرف: 5 غرف واسعة ومريحة
- الطابق: الثالث، بإطلالة شرقية-قبلية
- التشطيب: ديكور فاخر وعصري
- المرافق: طاقة شمسية للمياه والكهرباء
- السعر: 60,000 دولار
- الموقع: الأعظمية، مدينة حلب
- حالة العقار: للبيع
- التقييم: 4.3 نجوم
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الأعظمية",
        status: 'بيع',
        price: '60000',
        area: '150',
        roomsNumber: '5',
        floor: '3',
        directions: 'شرقي-قبلي',
        contact_info: '+963940401875',
        date: '08/01/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '21',
        title: 'محل تجاري في شارع المحكمة العسكرية',
        description: `🌟
محل تجاري فاخر للبيع في شارع اسكندرون – الجميلية، حلب
🏢 المساحة: 100 متر مربع من الفخامة التجارية
🚪 عدد الغرف: 2 غرف بتصميم عملي وأنيق
📍 الموقع: قلب الجميلية، في منطقة تجارية نشطة تُعد الوجهة المثالية للأعمال الناجحة
🧭 الاتجاه: شرقي، لضوء طبيعي يعزز جاذبية المكان
💰 السعر: 300,000 دولار – استثمار ذكي بمردود مضمون
🔋 المرافق: تجهيزات حديثة تلبي احتياجات المشاريع الطموحة
📞 للتواصل: +963940101235
📅 تاريخ النشر: 01/03/2025
💡 لماذا هذا العقار؟
✔ موقع استراتيجي يجذب العملاء يوميًا
✔ تصميم مرن يناسب مختلف أنواع المشاريع
✔ فرصة ذهبية للاستثمار في منطقة تجارية واعدة
`,
        governorate: 'حلب',
        city: "حلب",
        region: "الجميلية",
        status: 'بيع',
        price: '300000',
        area: '100',
        roomsNumber: '2',
        floor: '0',
        directions: 'شرقي',
        contact_info: '+963940101235',
        date: '01/03/2025',
        is_sub: true
        , sub_type: 'حصري',
        rating: '4.3'
    },
    {
        id: '22',
        title: ' شقة سوبر ديلوكس في  المزة',
        description: `🏡 فرصة لا تُفوَّت لاقتناء شقة سوبر ديلوكس في قلب المالكي – دمشق! 🏡
✨ المواصفات الفاخرة:
- المساحة: 300 متر مربع من الفخامة والراحة
- عدد الغرف: 7 غرف بتصميم واسع ومميز
- الطابق: الثالث، بإطلالة ساحرة من ثلاث اتجاهات (شمالي-غربي-قبلي)
- التشطيب: ديكور سوبر ديلوكس بأرقى التصاميم العصرية
- المرافق: طاقة شمسية لتوفير المياه والكهرباء بكفاءة عالية
- السعر: 500,000 دولار – صفقة تستحق الاستثمار
- الموقع: منطقة المالكي الراقية، قلب دمشق النابض بالحياة
- حالة العقار: للبيع – فرصة نادرة للحصول على شقة بهذا المس
`,
        governorate: 'دمشق',
        city: "دمشق",
        region: "المالكي",
        status: 'بيع',
        price: '500000',
        area: '300',
        roomsNumber: '7',
        floor: '3',
        directions: 'شمالي-غربي-قبلي',
        contact_info: '+963948801235',
        date: '06/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '23',
        title: 'أرض زراعية في ريف حلب',
        description: `🌿 فرصة ذهبية للاستثمار الزراعي في طريق دارة عزة – حلب! 🌿
✨ المواصفات:
- المساحة: 20,000 متر مربع من الأراضي الخصبة
- عدد الغرف: 1 غرفة داخلية للمرافق الزراعية
- الطابق: الأرضي – مثالي للاستخدام الزراعي المباشر
- الموقع: جنوب مدينة حور، قرب طريق دارة عزة
- السعر: 200,000 دولار – عرض مغري لمستثمري القطاع الزراعي
- حالة العقار: للبيع
- التقييم: 4.3 نجوم
`,
        governorate: 'حلب',
        city: "عنجارة",
        region: "جنوب المدينة",
        status: 'بيع',
        price: '200000',
        area: '20000',
        roomsNumber: '1',
        floor: '0',
        directions: '',
        contact_info: '+963940409935',
        date: '08/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '24',
        title: 'شقة بديكور ممتاز',
        description: ` شقة متواضعة للإيجار في مركز مدينة حمص – منطقة الإذاعة 🏡
✨ المواصفات:
- المساحة: 100 متر مربع
- عدد الغرف: 4 غرف بتصميم عملي
- الطابق: الرابع، بإطلالة غربية-قبلية تمنح إضاءة رائعة
- السعر: 1,000 دولار سنويا – عرض مناسب في قلب المدينة
- حالة العقار: للإيجار
- الموقع: منطقة الإذاعة، في قلب مدينة حمص
`,
        governorate: 'حمص',
        city: "حمص",
        region: "الحميدية",
        status: 'آجار',
        price: '1000',
        area: '100',
        roomsNumber: '4',
        floor: '4',
        directions: 'غربي-قبلي',
        contact_info: '+963940774435',
        date: '01/03/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '25',
        title: 'مزرعة بمساحة جيدة  ',
        description: `🌿 فرصة ذهبية لامتلاك مزرعة بموقع مميز في خان العسل – حلب! 🌿
✨ المواصفات:
- المساحة: 1,000 متر مربع من الأراضي الخصبة
- عدد الغرف: 6 غرف بتصميم عملي ومريح
- الطابق: أرضي، مناسب للحياة الريفية والاستثمار الزراعي
- الاتجاهات: غربي - قبلي - شرقي - شمالي، لضوء طبيعي طوال اليوم
- الموقع: غرب المدينة، خان العسل – منطقة هادئة ومثالية للزراعة
- المرافق: مجهزة بمسبح واسع (7×5 متر) للاستجمام والراحة
- السعر: 70,000 دولار – فرصة رائعة للاستثمار الريفي
السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "خان العسل",
        region: "غرب المدينة",
        status: 'بيع',
        price: '70000',
        area: '1000',
        roomsNumber: '6',
        floor: '0',
        directions: 'غربي-قبلي-شرقي-شمالي',
        contact_info: '+963940654235',
        date: '01/04/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '26',
        title: 'شقة  ',
        description: `شقة فاخرة للبيع في كورنيش الإذاعة
- المساحة: 200 متر مربع
- عدد الغرف: 5 غرف واسعة
- الطابق: الثاني، بإطلالة رائعة على الكورنيش
- التشطيب: ديكور كامل بتصميم عصري وأنيق
- المرافق: طاقة شمسية للمياه والكهرباء لضمان الاستدامة
- السعر: مغري ومناسب للمواصفات`,
        governorate: 'حلب',
        city: "حلب",
        region: "حلب الجديدة شمالي",
        status: 'بيع',
        price: '200000',
        area: '250',
        roomsNumber: '6',
        floor: '4',
        directions: 'شمالي-غربي-قبلي',
        contact_info: '+963948888235',
        date: '01/01/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    },
    {
        id: '27',
        title: 'مستودع    ',
        description: ` فرصة رائعة لامتلاك مستودع واسع لتخزين البضائع في حي الوادي – حماة! 🏢
✨ المواصفات:
- المساحة: 300 متر مربع لتخزين وتنظيم البضائع بسهولة
- عدد الغرف: 2 غرف داخلية لتوفير أقصى درجات الراحة والعملية
- الطابق: الأرضي، مما يسهل عمليات التحميل والتفريغ
- الاتجاهات: شمالي - شرقي، لإضاءة طبيعية وتهوية جيدة
- الموقع: حي الوادي، حماة – منطقة حيوية ومناسبة للأعمال التجارية
- السعر: 50,000 دولار – عرض مغري للاستثمار
`,
        governorate: 'حماة',
        city: "حماة",
        region: "حي الوادي",
        status: 'بيع',
        price: '50000',
        area: '300',
        roomsNumber: '2',
        floor: '0',
        directions: 'شمالي-شرقي',
        contact_info: '+963940401235',
        date: '01/04/2025',
        is_sub: true
        , sub_type: 'مميز',
        rating: '4.3'
    }
];
const DUMMY_IMAGES = [
    { propertyId: '1', src: '/assets/pics/propertydumpic/pexels-curtis-adams-1694007-3555615.jpg' },
    { propertyId: '1', src: '/assets/pics/propertydumpic/pexels-curtis-adams-1694007-3935316.jpg' },
    { propertyId: '1', src: '/assets/pics/propertydumpic/pexels-hemanthnirujogi-2555635.jpg' },
    { propertyId: '1', src: '/assets/pics/propertydumpic/pexels-igor-starkov-233202-1693946.jpg' },
    { propertyId: '2', src: '/assets/pics/propertydumpic/pexels-pixabay-164522.jpg' },
    { propertyId: '2', src: '/assets/pics/propertydumpic/pexels-pixabay-209315.jpg' },
    { propertyId: '2', src: '/assets/pics/propertydumpic/pexels-pixabay-221540.jpg' },
    { propertyId: '3', src: '/assets/pics/propertydumpic/pexels-pixabay-277667.jpg' },
    { propertyId: '3', src: '/assets/pics/propertydumpic/pexels-sevenstormphotography-981916.jpg' },
    { propertyId: '3', src: '/assets/pics/propertydumpic/pexels-alexander-isreb-880417-1797393.jpg' },
    { propertyId: '3', src: '/assets/pics/propertydumpic/pexels-chaitaastic-1918291.jpg' },
    { propertyId: '3', src: '/assets/pics/propertydumpic/pexels-fotoaibe-813692.jpg' },
    { propertyId: '3', src: '/assets/pics/propertydumpic/pexels-fotoaibe-1571460.jpg' },
    { propertyId: '4', src: '/assets/pics/propertydumpic/pexels-fotoaibe-1571468.jpg' },
    { propertyId: '4', src: '/assets/pics/propertydumpic/pexels-fotoaibe-1643384.jpg' },
    { propertyId: '4', src: '/assets/pics/propertydumpic/pexels-fotoaibe-1743227.jpg' },
    { propertyId: '4', src: '/assets/pics/propertydumpic/pexels-john-tekeridis-21837-1428348.jpg' },
    { propertyId: '5', src: '/assets/pics/propertydumpic/pexels-julia-kuzenkov-442028-1974596.jpg' },
    { propertyId: '5', src: '/assets/pics/propertydumpic/pexels-pixabay-259588.jpg' },
    { propertyId: '5', src: '/assets/pics/propertydumpic/pexels-pixabay-259962.jpg' },
    { propertyId: '5', src: '/assets/pics/propertydumpic/pexels-pixabay-271624.jpg' },
    { propertyId: '5', src: '/assets/pics/propertydumpic/pexels-sevenstormphotography-981916.jpg' },
    { propertyId: '5', src: '/assets/pics/propertydumpic/pexels-pixabay-280222.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-zachtheshoota-1838640.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-naimbic-2030037.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-pixabay-271795.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-jvdm-1457841.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-jvdm-1457841.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-pixabay-280212.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-curtis-adams-1694007-3555615.jpg' },
    { propertyId: '6', src: '/assets/pics/propertydumpic/pexels-curtis-adams-1694007-3555615.jpg' },
];
const DUMMY_AMENITIES = [
    { propertyId: '1', amenity: 'مصعد', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '1', amenity: 'اكساء مميز', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '1', amenity: 'نظام تدفئة مركزي', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنريبريبريبريبتسيؤتسشيؤمسيتؤ' },
    { propertyId: '1', amenity: 'أرضيات من الرخام أو الباركيه', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '2', amenity: 'شرفة رائعة', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '2', amenity: 'أجهزة منزلية', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '2', amenity: 'إنترنت عالي السرعة', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '2', amenity: 'نظام أمان', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتربربريبرابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '2', amenity: 'مسبح', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '3', amenity: 'كاميرات مراقبة', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '3', amenity: 'إطلالة بحرية', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '3', amenity: 'ساونا', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '3', amenity: 'جاكوزي', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثريبرليبرنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '4', amenity: 'خزائن حائط', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '4', amenity: 'حارس أمن على مدار الساعة', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيؤمسيتؤ' },
    { propertyId: '4', amenity: 'موقع قريب من المدارس أو الجامعات', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤتسشيريبريبريبرؤمسيتؤ' },
    { propertyId: '4', amenity: 'نوافذ مزدوجة العزل', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيرتيبمنترايبةرىيعهغابرهنميسبىرنميؤتسشيؤمسيتؤ' },
    { propertyId: '5', amenity: 'إنترنت عالي السرعة', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسيؤلمينالتنيبانمىثرتانتقةوربيمنلتميسنليتسشيؤمسيتؤ' },
    { propertyId: '5', amenity: 'كاميرات مراقبة', description: 'منؤشسينؤسعهىعهسيتنؤاىسينتاؤلانئءاليبهتؤامسشثنتابؤهاىنتسييفصشعلتنسثىمبنتسايرىؤيةوبىرهعايلابةويىبناسيبنتلاسينبتليؤتسشيؤمسيتؤ' },
];
const PropertyClient = ({ id }) => {

    const [property, setproperty] = useState({});
    const [propertyimages, setpropertyimages] = useState([]);
    const [amenities, setamenities] = useState([]);
    const [owner, setowner] = useState(null);
    const [numofraters, setnumofraters] = useState(0);
    const [Loading, setLoading] = useState(false);
    const [similarproperties, setsimilarproperties] = useState([]);
    const increased = useRef(false);
    useEffect(() => {
        const fetchAll = async () => {
            try {
                setLoading(true);

                const [propertyRes, imagesRes, amenitiesRes, ownerRes] = await Promise.all([
                    axios.get(`http://localhost:8000/api/properties/${id}`),
                    axios.get(`http://localhost:8000/api/getImage/${id}`),
                    axios.get(`http://localhost:8000/api/getAminity/${id}`),
                    axios.get(`http://localhost:8000/api/user/${id}`)
                ]);

                setproperty(propertyRes.data);
                setpropertyimages(imagesRes.data.images);
                setamenities(amenitiesRes.data.data);
                setowner(ownerRes.data.user);
                console.log(propertyRes.data);
            } catch (err) {
                console.log("خطأ في جلب البيانات", err);
            } finally {
                setLoading(false);
            }
        };

        fetchAll();
    }, [id]);
    useEffect(() => {
        const increaseviewsby1 = async () => {
            if (increased.current) {
                return;
            }
            increased.current = true;
            try {
                const res = await fetch(`http://localhost:8000/api/properties/${id}/view`, {
                    method: "POST",
                    headers: {
                        'Accept': 'application/json'
                    }
                });
                const data = await res.json();
                if (res.ok) {
                    console.log(data);
                    console.log('نجاح زيادة عدد المشاهدات');
                }
            } catch {
                console.log('فشل زيادة عدد المشاهدات');
            }
        }
        increaseviewsby1();
    }, [])
    useEffect(() => {
        const fetchnumofraters = async () => {
            if (!id) return;
            try {
                const res = await fetch(`http://localhost:8000/api/properties/${id}/ratings/count`, {
                    method: 'GET',
                    headers: {
                        'Accept': 'application/json'
                    }
                });
                const data = await res.json();
                console.log(data);
                if (res.ok) {
                    setnumofraters(data.ratings_count);
                    console.log('نجاح جلب عدد المقيمين');
                }
            } catch { console.log('فشل في جلب عدد المقيمين') }
        }
        fetchnumofraters();
    }, [id]);
    useEffect(() => {
        const fetchSimilar = async () => {
            try {
                setLoading(true);
                const res = await fetch(`http://localhost:8000/api/properties/${id}/similar`, {
                    method: 'GET',
                    headers: {
                        'Accept': 'application/json',
                    },
                });

                if (res.ok) {
                    console.log('نجاح جلب العقارات المشابهة')
                }

                const data = await res.json();
                console.log(data);
                const formatted = data.data.map((item) => ({
                    id: item.id,
                    city: item.city_name,
                    region: item.region_name,
                    date: item.created_at,
                    area: item.space,
                    sub_type: item.featured,
                    status: item.status,
                    type: item.type,
                    title: item.title,
                    price: item.price,
                    url: item.first_image
                        ? item.first_image
                        : '/assets/pics/propertydumpic/placeholder.png',
                }));
                console.log(formatted);
                setsimilarproperties(formatted);
            } catch (error) {
                console.log(error.message);
                console.log('فشل في جلب العقارات المشابهة');
            } finally {
                setLoading(false);
            }
        };

        fetchSimilar();
    }, [])
    return (
        <Fragment>
            <div className={`${classes.global} ${Readex_Pro_Font.className}`}>
                <Navbar mainpage={false} />
                <div className={classes.imagesanddescription}>
                    <TitleAndDescription title={property.title} status={property.status} description={property.description} code={property.id} />
                    <ImagesContainer images={propertyimages} />
                </div>
                <div className={classes.specifications}>
                    <Specifications
                        governorate={property.governorate_name}
                        city={property.city_name}
                        region={property.region_name}
                        price={property.price}
                        area={property.space}
                        directions={property.direction}
                        roomsNumber={property.rooms}
                        created_at={property.created_at}
                        featured={property.featured}
                        floor={property.floor} />
                    {owner && <Ownerdetails owner={owner} />}
                </div>
                {amenities.length > 0 && <PropertyAmenities amenities={amenities} />}
                <PropertyVideo video={property.video_url} />
                <Statistics views={property.views} rating={property.rating} numofraters={numofraters} created_at={property.created_at} />
                <CommentsSection id={id} />
                <ContactInfo contactInfo={property.contact_info} />
                <SimilarProperties similar={similarproperties} />
                {Loading && <div className={classes.overlay}>
                    <div className={classes.spinner}></div>
                    <p>جار التحميل...</p>
                </div>}
                <Footer />
            </div>
        </Fragment>
    );
};
export default PropertyClient;

